## Boolean - bool
True

False

## Comparison operators
- Equality == (nb two ==)
- Inequality !=
- Less than <
- Greater than >
- Less than or equal <=
- Greater than or equal >=

In [1]:
3 == 3

True

In [2]:
3 == 4

False

In [3]:
3 == 3.0

True

In [4]:
3 == "3"

False

In [5]:
3 == 3+0j

True

In [6]:
"3" == "3"

True

In [7]:
3 != "3"

True

In [8]:
3 >= 3

True

In [9]:
3 >= 2

True

In [10]:
3 >= 4

False

In [11]:
3 <= 4

True

In [12]:
3 <= 3

True

In [13]:
3 <= 2

False

In [14]:
#3 <= "3"

This is a mistake cell

## if

In [15]:
if 3 == 3:
    print("We have equality!!")
    print("3 is equal to three")
print("This will always run")

We have equality!!
3 is equal to three
This will always run

In [16]:
if 3 == 4:
    print("We have equality!!")
    print("3 is equal to three")
print("This will always run")

This will always run

In [17]:
# Will run
if 3 == 3:
    print("We have equality!!")
    print("3 is equal to three")
# Will not run    
else:
    print("These are not equal!!")
    print("Where is my three??")
# Will always run
print("This will always run")

We have equality!!
3 is equal to three
This will always run

In [18]:
# Will not run
if 3 == 4:
    print("We have equality!!")
    print("3 is equal to three")
# Will run    
else:
    print("These are not equal!!")
    print("Where is my three??")
# Will still run
print("This will always run")

These are not equal!!
Where is my three??
This will always run

In [19]:
subject = "programming"

if subject == "programming":
    print("Best class!!")
else:
    print("Its still good...")

Best class!!

In [20]:
subject = "data vis"

if subject == "programming":
    print("Best class!!")
else:
    print("Its still good...")

Its still good...

In [21]:
subject = "programming"

if subject == "programming":
    print("Best class!!")
# elif is short for else if
elif subject == "data vis":
    print("Don't tell David I said that")
elif subject == "programming":
    print("Python is fun!")
else:
    print("Its still good...")

Best class!!

In [22]:
subject = "programming"

if subject == "programming":
    print("Best class!!")
if subject == "data vis":
    print("Don't tell David I said that")
if subject == "programming":
    print("Python is fun!")
else:
    print("Its still good...")

Best class!!
Python is fun!

In [23]:
subject = "data vis"

if subject == "programming":
    print("Best class!!")
if subject == "data vis":
    print("Don't tell David I said that")
if subject == "programming":
    print("Python is fun!")
else:
    print("Its still good...")

Don't tell David I said that
Its still good...

## Libraries
A library is a bunch of code that other people made that we can use

This lets us use tested, efficient, and complex functionalities without having to write it ourselves

main ones for this class: numpy, pandas

In [24]:
import pandas

/var/folders/1m/71syl3xd3910y8gqrq29f4w40000gn/T/ipykernel_27390/3648170110.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas

In [25]:
data = pandas.read_csv("GSAF5.csv")

/var/folders/1m/71syl3xd3910y8gqrq29f4w40000gn/T/ipykernel_27390/2934047814.py:1: DtypeWarning: Columns (0,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,21,22) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pandas.read_csv("GSAF5.csv")

In [30]:
data.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
0,10 Nov-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Port Noarlunga,Free diving,Bridgette O’Shannessy,F,32,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,05 Nov-2023,2023.0,Unprovoked,USA,Florida,"Juno Beach, Palm Beach County",Swimming,Steven Reinhardt,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,03 Nov-2023,2023.0,Unprovoked,AUSTRALIA,Westerm Australia,Peak Island,Spearfishing,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,02 Nov-2023,2023.0,Unprovoked,NEW ZEALAND,North Island,Cape Pallister,Free diving,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Reported 02 Nov-2023,2023.0,Questionable,EGYPT,Southern Red Sea,Fury Shoal,Scuba diving,Gary Virgo,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [26]:
import pandas as x

In [27]:
datax = x.read_csv("GSAF5.csv")

/var/folders/1m/71syl3xd3910y8gqrq29f4w40000gn/T/ipykernel_27390/1930735131.py:1: DtypeWarning: Columns (0,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,21,22) have mixed types. Specify dtype option on import or set low_memory=False.
  datax = x.read_csv("GSAF5.csv")

In [28]:
datax.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
0,10 Nov-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Port Noarlunga,Free diving,Bridgette O’Shannessy,F,32,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,05 Nov-2023,2023.0,Unprovoked,USA,Florida,"Juno Beach, Palm Beach County",Swimming,Steven Reinhardt,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,03 Nov-2023,2023.0,Unprovoked,AUSTRALIA,Westerm Australia,Peak Island,Spearfishing,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,02 Nov-2023,2023.0,Unprovoked,NEW ZEALAND,North Island,Cape Pallister,Free diving,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Reported 02 Nov-2023,2023.0,Questionable,EGYPT,Southern Red Sea,Fury Shoal,Scuba diving,Gary Virgo,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
import pandas as pd
import numpy as np

In [30]:
data["Country"]

0          AUSTRALIA
1                USA
2          AUSTRALIA
3        NEW ZEALAND
4              EGYPT
            ...
38976            NaN
38977            NaN
38978            NaN
38979            NaN
38980            NaN
Name: Country, Length: 38981, dtype: object

In [31]:
data["Country"] == "IRELAND"

0        False
1        False
2        False
3        False
4        False
         ...
38976    False
38977    False
38978    False
38979    False
38980    False
Name: Country, Length: 38981, dtype: bool

In [32]:
data[ data["Country"] == "IRELAND" ]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
553,01-Sep-2018,2018.0,Provoked,IRELAND,County Cork,NaN,Fishing,Robert Malcolmson,M,40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5893,15-Jul-1917,1917.0,Sea Disaster,IRELAND,Off Ireland,82 miles from Fastnet,Ship Mariston torpedoed & sunk,NaN,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [33]:
# In a dataframe, to combine queries we can use & for "and" and a | for "or"
data[ (data["Country"] == "IRELAND") & (data["Type"] == "Provoked")]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
553,01-Sep-2018,2018.0,Provoked,IRELAND,County Cork,NaN,Fishing,Robert Malcolmson,M,40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [34]:
data[ (data["Country"] == "AUSTRALIA") & (data["Type"] == "Provoked")]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
215,07-Aug-2021,2021.0,Provoked,AUSTRALIA,Queensland,North Stradbroke Island,Harassing sharks,Rick Manning,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
223,27-Jul-2021,2021.0,Provoked,AUSTRALIA,Western Australia,Varanus Island,Fishing,male,M,34,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
281,20-Feb-2021,2021.0,Provoked,AUSTRALIA,Queensland,Waterford West,Fishing,Jason Rogers,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
323,17-Sep-2020,2020.0,Provoked,AUSTRALIA,Queensland,Fraser Island,Fishing,male,M,50s,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
406,20-Dec-2019,2019.0,Provoked,AUSTRALIA,New South Wales,Shellharbour,Fishing,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6017,05-Dec-1909,1909.0,Provoked,AUSTRALIA,New South Wales,Bondi,Fishing,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6083,16-Apr-1906,1906.0,Provoked,AUSTRALIA,Victoria,Western Port Bay,Shooting sharks,Leo Clarke,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6290,02-Mar-1892,1892.0,Provoked,AUSTRALIA,New South Wales,Lake Macquarie,Fishing,Christopher Wang,M,21,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6291,1892,1892.0,Provoked,AUSTRALIA,Torres Strait,Badu Island,Dress diving,Mr. A. Rotaman,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6462,07-Apr-1877,1877.0,Provoked,AUSTRALIA,Tasmania,Smelting Works Bay near Hobart,NaN,John Smart,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN